#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.flyte_db_password: Refreshing state... [id=none]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
google_container_node_pool.flyte_basic_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-basic-cluster/nodePools/flyte-basic-np]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_container_cluster.flyte_basic_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-basic-cluster]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
data.google_client_config.default: Reading...
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_composer_environment.ds_orchestrator will be created
  + resource "google_composer_environment" "ds_orchestrator" {
      + id      = (known after apply)
      + name    = "pricing-aggregator-orchestrator"
      + project = (known after apply)
      + region  = "us-east1"

      + config {
          + airflow_uri      = (known after apply)
          + dag_gcs_prefix   = (known after apply)
          + environment_size = "ENVIRONMENT_SIZE_SMALL"
          + gke_cluster      = (known after apply)
          + node_count       = (known after apply)
          + resilience_mode  = (known after apply)

          + node_config {
              + disk_size_gb         = (known after apply)
              + enable_ip_masq_agent = (known after apply)
              + ip_allocation_policy = (known after apply)
              + machine_type         = (known after apply)
              + network              = (known after apply)
              + oauth_scopes         = (known after apply)
              + service_account      = (known after apply)
              + zone                 = (known after apply)
            }

          + software_config {
              + image_version   = "composer-2.3.4-airflow-2.5.3"
              + python_version  = (known after apply)
              + scheduler_count = (known after apply)
            }

          + workloads_config {
              + scheduler {
                  + count      = 1
                  + cpu        = 1
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + web_server {
                  + cpu        = 1
                  + memory_gb  = 1.875
                  + storage_gb = 2
                }
              + worker {
                  + cpu        = 1
                  + max_count  = 4
                  + memory_gb  = 1.875
                  + min_count  = 1
                  + storage_gb = 1
                }
            }
        }
    }

  # google_container_cluster.flyte_basic_cluster will be destroyed
  # (because google_container_cluster.flyte_basic_cluster is not in configuration)
  - resource "google_container_cluster" "flyte_basic_cluster" {
      - cluster_ipv4_cidr           = "10.0.0.0/14" -> null
      - enable_autopilot            = false -> null
      - enable_binary_authorization = false -> null
      - enable_intranode_visibility = false -> null
      - enable_kubernetes_alpha     = false -> null
      - enable_l4_ilb_subsetting    = false -> null
      - enable_legacy_abac          = false -> null
      - enable_shielded_nodes       = true -> null
      - enable_tpu                  = false -> null
      - endpoint                    = "34.138.155.98" -> null
      - id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-basic-cluster" -> null
      - initial_node_count          = 2 -> null
      - label_fingerprint           = "a9dc16a7" -> null
      - location                    = "us-east1-b" -> null
      - logging_service             = "logging.googleapis.com/kubernetes" -> null
      - master_version              = "1.26.5-gke.1200" -> null
      - monitoring_service          = "monitoring.googleapis.com/kubernetes" -> null
      - name                        = "flyte-basic-cluster" -> null
      - network                     = "projects/exemplary-tide-379122/global/networks/default" -> null
      - networking_mode             = "ROUTES" -> null
      - node_locations              = [] -> null
      - node_version                = "1.26.5-gke.1200" -> null
      - project                     = "exemplary-tide-379122" -> null
      - remove_default_node_pool    = true -> null
      - resource_labels             = {} -> null
      - self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-basic-cluster" -> null
      - services_ipv4_cidr          = "10.3.240.0/20" -> null
      - subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> null

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRS3llK2ZVbFlYRzNGVTM0cWlsQ005VEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSa09XTXlPREEzT1MwMlpERXlMVFJrTURRdFlUbG1PUzAxTWpZME1XVXdPVFZoTXpJdwpJQmNOTWpNd056SXpNVEV6T0RJeFdoZ1BNakExTXpBM01UVXhNak00TWpGYU1DOHhMVEFyQmdOVkJBTVRKR1E1Cll6STRNRGM1TFRaa01USXROR1F3TkMxaE9XWTVMVFV5TmpReFpUQTVOV0V6TWpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU5BUnowNEpZdG1xUFBjUStkLzVteGc2MkhEamRPUGJPUnBHODRFbwpiOTFuRnRqSGxsNDlaYTFyTzkxNkpkYnhTaWZRWDlvaStOc2I1Y2ZmcWpnWUY1Q3N1UFZudVVRQ2trbE4yRzl3Ck1YM0tFTEVoc0RWZTB3MDl4cm10ZVFHZWg2KzdpYzhrWC9nUDdndnExNk81cDFTcUpKSFJnajM5RXRrTWY3OEkKQ1ZkWUNVMit2QjE3QW5yLytlb0lRSTFtY3hmSGhtS1hYUFV0K1FENFZUK0E2TFcvbGVRWGhablREdFhIM2tYbgpPdnlVSVl6aW8wUk53WU1GN1I1ZFBzaEhRN2lsUjVobTMrNXlJVk9mcWNhc1g4Qk9rQjRuZkNlYjRuVXBLLy9rCmdyeG1Ka21hN2JTQzZETDlsSk5ockI3NjR6ckQyWmgxU0pqaU55aVY5TnhSOG1Ra09XZktST1M5cEh0d05VQ1kKSDZsRTFDUVh4S2orV1EzeWt4dVNzTUYwUmxNM0dXcnFqQVFmeU9LUzBTM2tuQ3pxdzhjeU1SS2xGbmVtamFMaQp5V0VSZkdiZUhKWTJYL3dTVkl6OTlsVlJKSFVOTG5nSTRxZE1kQ3duSHkyYWZxZWNaVVRmYUpTUXBFcSttc2dSCnpaci9PNjVYcWV5V0owb2E0VDJrSmVESDhRSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVVCZW53QW1BTnNkTHB6b0dxeFdnM3RzOFRza013RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFLVUZ0QlY5U3FHSXZNcEZIWG45OXhZdllTSW1xcndCZlBSZ1ZZQWJlb0lzCndVSGU1ZG85dmpWMjJwUHJ1bDdac3NZNSt1QWZOTy9KbVpwNXJDYkRQTEo3enk5MkV0b3dCSHhicjhMR1FURlQKUGxIanZybzdtSmhzMmpWTjdDdENBTTYzRU5PQ2V6Vm5hbFJKWmRBZWthYWlwOTVHaHkxZVVSdjFYWmxQb2ZrMgpRekFlVkYrOVFzQWpVUXJtZUVqK2xNZE15aXdaMVBHcnVEN1ZGZ2Q1TjJqVktDbW41R0NRYm9FSm9FTTVKWjR1Clc0YTNjR2xVNFN1cENSblp0ckgwZUxkV3VHMWdiZk1WYys2Y0VFY0Yxd2pBUXcwVXNIKy9aOW81aFJ4Tmo4QU4KSGZMZHhpU2tLSkRoRTNOdlk4Wk1aQmJLYzFCbnZQaENlSlJDSzdQZHVDdHJhV2twa1VIRmRFMjlhZ2Q5dXAvOQpHMm83Tk1Ga013RDk0bURpTHVRQnl2VmFSUTlKZ0JPUEM2U3Y4TXpJY2NoNm45ODU0V2tsQmh6ckJvMTBWZjVTCnJOZWxpNVY3Mm0ySnRsOG5KSjVzSHhoZ2lURlczcmovcVAwVGZuR1ZGaVJGSHF1UWdNUnh1dm5iOWJLNklHZGEKaHBEYXVuRlJKbTk0YXEyZFBnTHllUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - master_authorized_networks_config {
          - gcp_public_cidrs_access_enabled = false -> null

          - cidr_blocks {
              - cidr_block   = "34.0.0.0/7" -> null
              - display_name = "connect-to-flyte-pg-db" -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-balanced" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {} -> null
          - local_ssd_count   = 0 -> null
          - logging_variant   = "DEFAULT" -> null
          - machine_type      = "e2-medium" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - resource_labels   = {} -> null
          - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
          - spot              = false -> null
          - tags              = [] -> null
          - taint             = [] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-basic-cluste-flyte-basic-np-c4bfafa3-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-basic-cluste-flyte-basic-np-c4bfafa3-grp",
            ] -> null
          - max_pods_per_node           = 0 -> null
          - name                        = "flyte-basic-np" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-east1-b",
            ] -> null
          - version                     = "1.26.5-gke.1200" -> null

          - autoscaling {
              - location_policy      = "ANY" -> null
              - max_node_count       = 4 -> null
              - min_node_count       = 2 -> null
              - total_max_node_count = 0 -> null
              - total_min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-medium" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - resource_labels   = {} -> null
              - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.10" -> null
          - public_endpoint         = "34.138.155.98" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.flyte_basic_node_pool will be destroyed
  # (because google_container_node_pool.flyte_basic_node_pool is not in configuration)
  - resource "google_container_node_pool" "flyte_basic_node_pool" {
      - cluster                     = "flyte-basic-cluster" -> null
      - id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-basic-cluster/nodePools/flyte-basic-np" -> null
      - initial_node_count          = 2 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-basic-cluste-flyte-basic-np-c4bfafa3-grp",
        ] -> null
      - location                    = "us-east1-b" -> null
      - managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-basic-cluste-flyte-basic-np-c4bfafa3-grp",
        ] -> null
      - name                        = "flyte-basic-np" -> null
      - node_count                  = 2 -> null
      - node_locations              = [
          - "us-east1-b",
        ] -> null
      - project                     = "exemplary-tide-379122" -> null
      - version                     = "1.26.5-gke.1200" -> null

      - autoscaling {
          - location_policy      = "ANY" -> null
          - max_node_count       = 4 -> null
          - min_node_count       = 2 -> null
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-balanced" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {} -> null
          - local_ssd_count   = 0 -> null
          - logging_variant   = "DEFAULT" -> null
          - machine_type      = "e2-medium" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - resource_labels   = {} -> null
          - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
          - spot              = false -> null
          - tags              = [] -> null
          - taint             = [] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

  # google_project_iam_binding.flyte_backend_role_binding will be destroyed
  # (because google_project_iam_binding.flyte_backend_role_binding is not in configuration)
  - resource "google_project_iam_binding" "flyte_backend_role_binding" {
      - etag    = "BwYAN5j5bpY=" -> null
      - id      = "exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole" -> null
      - members = [
          - "serviceAccount:flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com",
        ] -> null
      - project = (sensitive value) -> null
      - role    = "projects/exemplary-tide-379122/roles/flyteBackendRole" -> null
    }

  # google_project_iam_custom_role.flyte_backend_role will be destroyed
  # (because google_project_iam_custom_role.flyte_backend_role is not in configuration)
  - resource "google_project_iam_custom_role" "flyte_backend_role" {
      - deleted     = false -> null
      - description = "Custom IAM role for the Flyte backend service" -> null
      - id          = "projects/exemplary-tide-379122/roles/flyteBackendRole" -> null
      - name        = "projects/exemplary-tide-379122/roles/flyteBackendRole" -> null
      - permissions = [
          - "cloudsql.databases.create",
          - "cloudsql.databases.delete",
          - "cloudsql.databases.get",
          - "cloudsql.databases.update",
          - "container.clusters.getCredentials",
          - "container.pods.create",
          - "container.pods.get",
          - "container.pods.list",
          - "storage.objects.create",
          - "storage.objects.delete",
          - "storage.objects.get",
          - "storage.objects.list",
          - "storage.objects.update",
        ] -> null
      - project     = "exemplary-tide-379122" -> null
      - role_id     = "flyteBackendRole" -> null
      - stage       = "GA" -> null
      - title       = "Flyte Backend Role" -> null
    }

  # google_project_iam_member.composer_worker will be created
  + resource "google_project_iam_member" "composer_worker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (sensitive value)
      + role    = "roles/composer.worker"
    }

  # google_project_iam_member.user_code_role_member will be destroyed
  # (because google_project_iam_member.user_code_role_member is not in configuration)
  - resource "google_project_iam_member" "user_code_role_member" {
      - etag    = "BwYAN5j5bpY=" -> null
      - id      = "exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - project = (sensitive value) -> null
      - role    = "roles/editor" -> null
    }

  # google_service_account.custom_composer_account will be created
  + resource "google_service_account" "custom_composer_account" {
      + account_id   = "composer-sa"
      + disabled     = false
      + display_name = "Custom Service Account for Cloud Composer V2"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.flyte_service_account will be destroyed
  # (because google_service_account.flyte_service_account is not in configuration)
  - resource "google_service_account" "flyte_service_account" {
      - account_id   = "flyte-sa" -> null
      - disabled     = false -> null
      - display_name = "Flyte Orchestrator Service Account" -> null
      - email        = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - id           = "projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - name         = "projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - project      = "exemplary-tide-379122" -> null
      - unique_id    = "108140097335705908315" -> null
    }

  # google_service_account.user_code_service_account will be destroyed
  # (because google_service_account.user_code_service_account is not in configuration)
  - resource "google_service_account" "user_code_service_account" {
      - account_id   = "user-code-sa" -> null
      - disabled     = false -> null
      - display_name = "User Code Service Account" -> null
      - email        = "user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - id           = "projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - name         = "projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
      - project      = "exemplary-tide-379122" -> null
      - unique_id    = "110620932169671042320" -> null
    }

  # google_service_account_iam_member.composer_agent will be created
  + resource "google_service_account_iam_member" "composer_agent" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (sensitive value)
      + role               = "roles/composer.ServiceAgentV2Ext"
      + service_account_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*